Modules/AdminCustomer/Http/Controllers/AdminCustomerController.php

select * from `customers` order by `id` desc
---
    public function index()
    {
        $data = [
            'menu' => 'customers',
        ];

        $customers = Customer::orderByDesc('id')->get();