Modules/AdminOrder/Http/Controllers/AdminOrderController.php

                ->orderByDesc('id')
                ->latest()->paginate($perPage);
        } else {
            $orders = Order::latest()->orderByDesc('id')->paginate($perPage);
---
select * from `orders` order by `created_at` desc, `id` desc limit 25 offset 0
select count(*) as aggregate from `orders`

    public function show($id)
    {
        $data = [
            'menu' => 'orders',
        ];

        $order = Order::with('orderedProducts','orderedProducts.orderProductOptions')->findOrFail($id);
---
select * from `order_product_option` where `order_product_option`.`order_product_id` in (7)
select * from `order_products` where `order_products`.`order_id` in (5)
select * from `orders` where `orders`.`id` = '5' limit 1

    public function edit($id)
    {
        $data = [
            'menu' => 'orders',
        ];

        $order = Order::where('id',$id)->with('orderedProducts','orderedProducts.orderProductOptions')->first();
        $customers = CustomerUser::select('id','email')->get();
        $products = Product::select('id','name','base_price','sku')->get();
---
select * from `order_product_option` where `order_product_option`.`order_product_id` in (1)
select * from `order_products` where `order_products`.`order_id` in (1)
select * from `orders` where `id` = '1' limit 1
select `id`, `email` from `customer_users`
select `id`, `name`, `base_price`, `sku` from `products` where `products`.`deleted_at` is null