Modules/AdminCoupon/Http/Controllers/AdminCouponHistoryController.php

    public function index()
    {
        $data = [
            'menu' => 'couponHistory',
        ];

        $couponHistories = DB::table('coupon_histories')
                    ->select('coupon_code', DB::raw('sum(order_amount) as total'))
                    ->groupBy('coupon_code')
                    ->get();
---
select `coupon_code`, sum(order_amount) as total from `coupon_histories` group by `coupon_code`