app/Utils/Option.php

    public static function get($name, $default = false)
    {
        if (!isset(self::$option)){
            self::__init();
        }

        $name = trim($name);

        if (array_key_exists($name, self::$option)) {
            return self::$option[$name];
        }

        //if not autoloaded get it from database
        $query = AdminOption::select('value')
            ->where('name', $name)
            ->first();
---
select `value` from `admin_options` where `name` = 'company_name' limit 1

    private function _loadSetting()
    {
        $opt = AdminOption::select('name', 'value')->where('autoload', '1')->get();
---
select `name`, `value` from `admin_options` where `autoload` = '1'