Modules/AdminProductQuestion/Http/Controllers/AdminProductQuestionController.php

select count(*) as aggregate from `product_questions`
---
    public function index(Request $request)
    {
        $data = [
            'menu' => 'product-questions',
        ];

        $keyword = $request->get('search');
        $perPage = 25;

        if (!empty($keyword)) {
            $productquestion = ProductQuestion::where('product_id', 'LIKE', "%$keyword%")
                ->orWhere('customer_id', 'LIKE', "%$keyword%")
                ->orWhere('name', 'LIKE', "%$keyword%")
                ->orWhere('description', 'LIKE', "%$keyword%")
                ->orWhere('email', 'LIKE', "%$keyword%")
                ->orWhere('status', 'LIKE', "%$keyword%")
                ->latest()
                ->orderByDesc('id')
                ->paginate($perPage);
        } else {
            $productquestion = ProductQuestion::latest()->orderByDesc('id')->paginate($perPage);