Modules/AdminProduct/Http/Controllers/AdminProductController.php

select `id`, `name`, `sku`, `base_price`, `quantity`, `status` from `products` where `products`.`deleted_at` is null order by `id` desc
---
    public function index()
    {
        $data = [
            'menu' => 'products',
        ];
        $products = Product::select('id','name','sku','base_price','quantity','status', 'return_policy_days')->orderByDesc('id')->get();