Modules/AdminApi/Http/Controllers/v1/CountryController.php

    public function getAllCountry()
    {
        $countries = Country::all();
---
select * from `countries`