Modules/AdminApi/Http/Controllers/v1/StateController.php

select * from `states` where `country_name` = '1'
---
    public function getCountryState($country_id)
    {
        $states = State::where('country_name',$country_id)->get();