Modules/AdminApi/Services/CustomerCheckoutService.php

                        foreach($request->cart as $cart)
                        {

                            $product = Product::where('status','1')->where('id',$cart['product_id'])->with('options')->first();
---
select * from `products` where `status` = '1' and `id` = 1 and `products`.`deleted_at` is null limit 1

                            {
                                foreach($cart['options'] as $option_id => $option_value){

                                    $product_option = ProductOption::where('id', $option_id)->first();
---
select * from `options` where `options`.`id` = 1 limit 1
select * from `product_options` where `id` = 1 limit 1

                            else{
                                $customerTransaction->status='pending';
                            }
                            $customerTransaction->save();
---
update `customer_transactions` set `status` = 'completed', `customer_transactions`.`updated_at` = '2021-05-28 22:47:08' where `id` = 6

     private function calculatePriceTax($product,$cart,$state)
     {
         $productPrice = $product->base_price ;
         $taxAmt = 0;
         $totalPrice = 0;
         $amtWithTax = 0;
        //  if product has variant
         if(count($product->options)>0){
            foreach($cart['options'] as $option_id => $option_value){
                $product_option = ProductOption::where('id', $option_id)->first();
---
select * from `options` where `options`.`id` = 1 limit 1
select * from `product_options` where `id` = 1 limit 1