Modules/AdminProductOption/Http/Controllers/AdminProductOptionController.php

    public function index(Request $request)
    {
        $data = [
            'menu' => 'options',
        ];

        $keyword = $request->get('search');
        $perPage = 25;

        if (!empty($keyword)) {
            $options = Option::where('type', 'LIKE', "%$keyword%")
                ->orWhere('name', 'LIKE', "%$keyword%")
                ->orWhere('sort_order', 'LIKE', "%$keyword%")
                ->with('optionValues')
                ->orderByDesc('id')
                ->get();
        } else {
            $options = Option::with('optionValues')->orderByDesc('id')->get();
---
select * from `option_values` where `option_values`.`option_id` in (1, 2, 3, 4, 5)